<?php
namespace common\components\ctrait;

trait DateTimeRu {

    public function getMonthRu()
    {
        return [
            1 => [
                'id' => 1,
                'header' => 'январь',
                'headerru' => [
                    'именительный' => 'январь',
                    'родительный' => 'января',
                    'дательный' => 'январю',
                    'винительный' => 'январь',
                    'творительный' => 'январем',
                    'предложный' => 'январе',
                ],
            ],
            2 => [
                'id' => 2,
                'header' => 'февраль',
                'headerru' => [
                    'именительный' => 'февраль',
                    'родительный' => 'февраля',
                    'дательный' => 'февралю',
                    'винительный' => 'февраль',
                    'творительный' => 'февралем',
                    'предложный' => 'феврале',
                ],
            ],
            3 => [
                'id' => 3,
                'header' => 'март',
                'headerru' => [
                    'именительный' => 'март',
                    'родительный' => 'марта',
                    'дательный' => 'марту',
                    'винительный' => 'март',
                    'творительный' => 'мартом',
                    'предложный' => 'марте',
                ],
            ],
            4 => [
                'id' => 4,
                'header' => 'апель',
                'headerru' => [
                    'именительный' => 'прель',
                    'родительный' => 'апреля',
                    'дательный' => 'апрелю',
                    'винительный' => 'апрель',
                    'творительный' => 'апрелем',
                    'предложный' => 'апреле',
                ],
            ],
            5 => [
                'id' => 5,
                'header' => 'май',
                'headerru' => [
                    'именительный' => 'май',
                    'родительный' => 'мая',
                    'дательный' => 'маю',
                    'винительный' => 'май',
                    'творительный' => 'маем',
                    'предложный' => 'мае',
                ],
            ],
            6 => [
                'id' => 6,
                'header' => 'июнь',
                'headerru' => [
                    'именительный' => 'июнь',
                    'родительный' => 'июня',
                    'дательный' => 'июню',
                    'винительный' => 'июнь',
                    'творительный' => 'июнем',
                    'предложный' => 'июне',
                ],
            ],
            7 => [
                'id' => 7,
                'header' => 'июль',
                'headerru' => [
                    'именительный' => 'июль',
                    'родительный' => 'июля',
                    'дательный' => 'июлю',
                    'винительный' => 'июль',
                    'творительный' => 'июлем',
                    'предложный' => 'июле',
                ],
            ],
            8 => [
                'id' => 8,
                'header' => 'август',
                'headerru' => [
                    'именительный' => 'август',
                    'родительный' => 'августа',
                    'дательный' => 'августу',
                    'винительный' => 'август',
                    'творительный' => 'августом',
                    'предложный' => 'августе',
                ],
            ],
            9 => [
                'id' => 9,
                'header' => 'сентябрь',
                'headerru' => [
                    'именительный' => 'сентябрь',
                    'родительный' => 'сентября',
                    'дательный' => 'сентябрю',
                    'винительный' => 'сентябрь',
                    'творительный' => 'сентябрём',
                    'предложный' => 'сентябре',
                ],
            ],
            10 => [
                'id' => 10,
                'header' => 'октябрь',
                'headerru' => [
                    'именительный' => 'октябрь',
                    'родительный' => 'октября',
                    'дательный' => 'октябрю',
                    'винительный' => 'октябрь',
                    'творительный' => 'октябрём',
                    'предложный' => 'октябре',
                ],
            ],
            11 => [
                'id' => 11,
                'header' => 'ноябрь',
                'headerru' => [
                    'именительный' => 'ноябрь',
                    'родительный' => 'ноября',
                    'дательный' => 'ноябрю',
                    'винительный' => 'ноябрь',
                    'творительный' => 'ноябрем',
                    'предложный' => 'ноябре',
                ],
            ],
            12 => [
                'id' => 12,
                'header' => 'декабрь',
                'headerru' => [
                    'именительный' => 'декабрь',
                    'родительный' => 'декабря',
                    'дательный' => 'декабрю',
                    'винительный' => 'декабрь',
                    'творительный' => 'декабрём',
                    'предложный' => 'декабре',
                ],
            ],
        ];
    }

}
